#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-Hp4GwkRR2VgTTBck

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.worker_user_data: Refreshing state... [id=7b29c053fc5cb761c95c9482964ea488b26051d2842dc795acf8623781d3bc95]
data.template_file.composer_brew_user_data: Refreshing state...
data.aws_iam_policy_document.imagebuilder_prod: Refreshing state... [id=1330906063]
data.aws_iam_policy_document.spotfleet_iam_role_policy: Refreshing state... [id=1116480091]
data.aws_iam_policy_document.vmimport_ec2: Refreshing state... [id=690884195]
data.aws_vpc.external_vpc: Refreshing state... [id=vpc-78468405]
data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
data.aws_iam_policy_document.spotfleet_iam_spot_policy: Refreshing state... [id=931116587]
data.aws_iam_policy_document.vmimport_s3: Refreshing state... [id=2072117659]
aws_s3_bucket.imagebuilder_stage: Refreshing state... [id=imagebuilder-service-stage]
aws_security_group.inernal_allow_egress: Refreshing state... [id=sg-014ab35d609e0e354]
aws_iam_user.imagebuilder_stage: Refreshing state... [id=imagebuilder-stage]
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
data.aws_iam_policy_document.imagebuilder_stage: Refreshing state... [id=2674406226]
aws_iam_user.imagebuilder_prod: Refreshing state... [id=imagebuilder-prod]
aws_s3_bucket.imagebuilder_prod: Refreshing state... [id=imagebuilder-service-prod]
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
data.aws_iam_policy_document.vmimport_trust: Refreshing state... [id=4085548158]
data.aws_caller_identity.current: Refreshing state... [id=933752197999]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder-spot-fleet-role]
aws_iam_policy.imagebuilder_prod_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-prod-workers-s3]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy]
aws_iam_policy.imagebuilder_stage_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder-stage-workers-s3]
aws_iam_role.vmimport: Refreshing state... [id=vmimport]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder-spot-fleet-role-20201116215323839200000002]
aws_iam_user_policy_attachment.imagebuilder_stage_vmimport: Refreshing state... [id=imagebuilder-stage-20201116212912312400000004]
aws_iam_user_policy_attachment.imagebuilder_prod_vmimport: Refreshing state... [id=imagebuilder-prod-20201116212912287200000003]
aws_iam_user_policy_attachment.imagebuilder_prod_s3: Refreshing state... [id=imagebuilder-prod-20201113204258223300000001]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport-20201116212912128900000002]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport-20201116212912375000000005]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder-spot-fleet-role-20201116215323938600000003]
aws_iam_user_policy_attachment.imagebuilder_stage_s3: Refreshing state... [id=imagebuilder-stage-20201113204258227600000002]
data.aws_subnet_ids.external_subnets: Refreshing state... [id=vpc-78468405]
aws_security_group.allow_icmp: Refreshing state... [id=sg-006658b39ca9f5b61]
aws_security_group.allow_cockpit: Refreshing state... [id=sg-0543de8f4ff71f41e]
aws_security_group.allow_egress: Refreshing state... [id=sg-0782a0692ac5b4fc8]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0e024d07c5f88082f]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-00901c19ede013963]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-05c05bf188420e333]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_launch_template.worker_x86: Refreshing state... [id=lt-0cbb229d67d85ee00]
data.aws_subnet.internal_subnet_primary: Refreshing state...
aws_spot_fleet_request.imagebuilder_worker_x86: Refreshing state... [id=sfr-d12d5010-d8ec-40a4-9d2b-01789c637644]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ebs_volume.composer_brew will be created
  + resource "aws_ebs_volume" "composer_brew" {
      + arn               = (known after apply)
      + availability_zone = "us-east-1a"
      + encrypted         = true
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 50
      + snapshot_id       = (known after apply)
      + tags              = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Composer for Brew"
          + "ServiceOwner" = "Image Builder"
        }
      + type              = "gp2"
    }

  # aws_eip.composer_brew will be created
  + resource "aws_eip" "composer_brew" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + vpc                  = true
    }

  # aws_instance.composer_brew will be created
  + resource "aws_instance" "composer_brew" {
      + ami                          = "ami-0c82f7789103a1e20"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t3.small"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "mhayden"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = "subnet-04a176042c3118735"
      + tags                         = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Composer for Brew"
          + "ServiceOwner" = "Image Builder"
        }
      + tenancy                      = (known after apply)
      + user_data                    = "42ce64e6f8d4f7415777c2449c6fb2cab2d29380"
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.inernal_allow_egress will be destroyed
  - resource "aws_security_group" "inernal_allow_egress" {
      - arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-014ab35d609e0e354" -> null
      - description            = "Allow egress traffic" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-014ab35d609e0e354" -> null
      - ingress                = [] -> null
      - name                   = "internal-allow-egress" -> null
      - owner_id               = "933752197999" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "internal-allow-egress"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - vpc_id                 = "vpc-06d6127910664367d" -> null
    }

  # aws_security_group.internal_allow_egress will be created
  + resource "aws_security_group" "internal_allow_egress" {
      + arn                    = (known after apply)
      + description            = "Allow egress traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "internal-allow-egress"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "internal-allow-egress"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                 = "vpc-06d6127910664367d"
    }

  # aws_volume_attachment.composer_brew will be created
  + resource "aws_volume_attachment" "composer_brew" {
      + device_name = "/dev/sdb"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 5 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*